documentation/komunikaty_zdjecia/zwrocMagazyn_req

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:klas="http://klasy/">
   <soapenv:Header/>
   <soapenv:Body>
      <klas:zwroc_magazyn/>
   </soapenv:Body>
</soapenv:Envelope>